#include <stdio.h>
#include <string.h>

#define N 10

int main()
{
	char name[N][9] = {"홍길동", "이몽룡", "성춘향", "제갈공명", "주몽", "배장화", "배홍련", "홍길동", "연홍부", "연놀부"};
	char phone[N][14] = {"010-5210-1234", "010-523-1628", "010-1235-8765", "010-345-1676", "010-5210-5463", "010-523-7979", "010-5210-1472", "010-8255-8255", "010-516-3483", "010-8282-8282"};
	
	double grade[N] = {4.2, 4.0, 3.2, 4.4, 3.7, 2.9, 4.0, 3.8, 3.2, 2.7};
	char who[9];
	int cnt, i;
	
	printf("정보를 찾고 싶은 학생 이름은? ");
	scanf("%s", who);
	
	printf("\n\n");
	printf("====================================\n"); 
	printf("  이름        전화번호       평점   \n");
	printf("====================================\n");
	
	cnt = 0;
	for (i=0; i<N; i++)
	{
		if (strcmp(who, name[i]) == 0)
		{
			cnt++;
			printf(" %-10s %-14s %5.1f \n", name[i], phone[i], grade[i]);
		}
	}
	printf("====================================\n");
	
	if (cnt == 0)
		printf(" %s(이)라는 학생은 없습니다. \n", who);
	else
		printf("총 %d명의 학생을 찾았습니다. \n", cnt);
	
	return 0;
}
